Table of Contents
 Class ResultOnSection
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Result of section on the member
[Obfuscation(Feature = "renaming")]
public class ResultOnSection : ResultBase
Inheritance
object
ResultBase
ResultOnSection
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ResultOnSection()
Constructor
public ResultOnSection()
Properties
 AbsoluteRelative
Absolute of relative value of position is used
public AbsoluteRelative AbsoluteRelative { get; set; }
Property Value
AbsoluteRelative
 Position
Position of section
public double Position { get; set; }
Property Value
double
 Results
List of result of members
public List<SectionResultBase> Results { get; set; }
Property Value
List<SectionResultBase>
 Edit this page